Revit 2027 API
Family.StructuralSectionShape Property
 The family's structural section shape.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public StructuralSectionShape StructuralSectionShape { get; set; }
Public Property StructuralSectionShape As StructuralSectionShape
	Get
	Set
public:
property StructuralSectionShape StructuralSectionShape {
	StructuralSectionShape get ();
	void set (StructuralSectionShape value);
}
member StructuralSectionShape : StructuralSectionShape with get, set
Property Value
StructuralSectionShape
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
InvalidOperationException |  When setting this property: This Family cannot have a structural section.
See Also
Reference
Family Class
Autodesk.Revit.DB Namespace